/*!------------------------------------------------
@file       Currency.h
@brief      
@attention  なし
--------------------------------------------------*/

#ifndef CURRENCY_H_
#define CURRENCY_H_

// インクルードファイル ================================

// クラスの前方宣言 ====================================

// マクロの宣言 ========================================

// 型の宣言 ============================================

// クラス定義 ==========================================
/*!--------------------------------------------------
@class       Currency.h
@brief      
@note       
@attention  なし
@see        なし
--------------------------------------------------*/
class Currency {
 public:
  //! Constructor
  Currency();
  //! Destructor
  virtual ~Currency();

 protected:
 private:
};

#endif  // CURRENCY_H_
