/*!------------------------------------------------
@file       DstCurrency.h
@brief      
@attention  なし
--------------------------------------------------*/

#ifndef DSTCURRENCY_H_
#define DSTCURRENCY_H_

// インクルードファイル ================================

// クラスの前方宣言 ====================================

// マクロの宣言 ========================================

// 型の宣言 ============================================

// クラス定義 ==========================================
/*!--------------------------------------------------
@class       DstCurrency.h
@brief      
@note       
@attention  なし
@see        なし
--------------------------------------------------*/
class DstCurrency {
 public:
  //! Constructor
  DstCurrency();
  //! Destructor
  virtual ~DstCurrency();

 protected:
 private:
};

#endif  // DSTCURRENCY_H_
