/*!------------------------------------------------
@file       Exchanger.h
@brief      
@attention  なし
--------------------------------------------------*/

#ifndef EXCHANGER_H_
#define EXCHANGER_H_

// インクルードファイル ================================

// クラスの前方宣言 ====================================

// マクロの宣言 ========================================

// 型の宣言 ============================================

// クラス定義 ==========================================
/*!--------------------------------------------------
@class       Exchanger.h
@brief      
@note       
@attention  なし
@see        なし
--------------------------------------------------*/
class Exchanger {
 public:
  //! Constructor
  Exchanger();
  //! Destructor
  virtual ~Exchanger();

 protected:
 private:
};

#endif  // EXCHANGER_H_
