/*!------------------------------------------------
@file       ExchangeRateUpdater.h
@brief      
@attention  なし
--------------------------------------------------*/

#include "ExchangeRateUpdater.h"

/*!------------------------------------------------
@brief      デフォルトコンストラクタ
@note       クラスを構築する
@attention  なし
--------------------------------------------------*/
ExchangeRateUpdater::ExchangeRateUpdater() {
}

/*!------------------------------------------------
@brief      デフォルトデストラクタ
@note       クラスを破棄する
@attention  なし
--------------------------------------------------*/
ExchangeRateUpdater::~ExchangeRateUpdater() {
}

/*!------------------------------------------------
@brief      
@note       
@param[in]  パラメータ名  説明  [単位] (範囲)
@param[out] 
@return     なし
@attention  なし
--------------------------------------------------*/
