/*!------------------------------------------------
@file       ExchangeRateList.h
@brief      
@attention  なし
--------------------------------------------------*/

#include "ExchangeRateList.h"

/*!------------------------------------------------
@brief      デフォルトコンストラクタ
@note       クラスを構築する
@attention  なし
--------------------------------------------------*/
ExchangeRateList::ExchangeRateList() {
}

/*!------------------------------------------------
@brief      デフォルトデストラクタ
@note       クラスを破棄する
@attention  なし
--------------------------------------------------*/
ExchangeRateList::~ExchangeRateList() {
}

/*!------------------------------------------------
@brief      
@note       
@param[in]  パラメータ名  説明  [単位] (範囲)
@param[out] 
@return     なし
@attention  なし
--------------------------------------------------*/
